scaling/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-10 -10 -10)
    (10,-10,-10)
    (10,10,-10)
    (-10,10,-10)
    (-10,-10,10)
    (10,-10,10)
    (10,10,10)
    (-10,10,10)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 50 50) simpleGrading (1 1 1)

);

edges
(
);

patches
(
	patch maxY
	(
		(3 7 6 2)
	)
	patch minX
	(
		(0 4 7 3)
	)
	patch maxX
	(
		(2 6 5 1)
	)
	patch minY
	(
		(1 5 4 0)
	)
	patch minZ
	(
		(0 3 2 1)
	)
	patch maxZ
	(
		(4 5 6 7)
	)
);

mergePatchPairs
(
);

// ************************************************************************* //
